In [148]:
'''
personId | lastName | firstName |
+----------+----------+-----------+
| 1        | Wang     | Allen     |
| 2        | Alice    | Bob  
'''
persondata = {
    "personID":[1,2],
    "lastname":["Wang","Alice"],
    "firstName":["Allen","Bob"]
}
persondata

{'personID': [1, 2],
 'lastname': ['Wang', 'Alice'],
 'firstName': ['Allen', 'Bob']}

In [149]:

'''
 addressId | personId | city          | state      |
+-----------+----------+---------------+------------+
| 1         | 2        | New York City | New York   |
| 2         | 3        | Leetcode      | California 
'''

addressdata = {
    "addressID":[1,2],
    "personID":[2,3],
    "city":["New York City","Leetcode"],
    "state":["New York","California"]
}
addressdata

{'addressID': [1, 2],
 'personID': [2, 3],
 'city': ['New York City', 'Leetcode'],
 'state': ['New York', 'California']}

In [150]:
import pandas as pd
persondf = pd.DataFrame(persondata)
persondf

   personID lastname firstName
0         1     Wang     Allen
1         2    Alice       Bob

In [151]:
addressdf = pd.DataFrame(addressdata)
addressdf

   addressID  personID           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [152]:
outputdf = persondf.merge(addressdf,on="personID",how="left")
outputdf

   personID lastname firstName  addressID           city     state
0         1     Wang     Allen        NaN            NaN       NaN
1         2    Alice       Bob        1.0  New York City  New York

In [153]:
outputdf[['firstName','lastname','city','state']]

  firstName lastname           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York

In [154]:
col_lst = ['firstName','lastname','city','state']
dropcol = list(set(outputdf.columns)-set(col_lst))
dropcol

['personID', 'addressID']

In [155]:
outputdf.drop(dropcol,axis=1,inplace = True)
outputdf

  lastname firstName           city     state
0     Wang     Allen            NaN       NaN
1    Alice       Bob  New York City  New York

In [156]:
outputdf

  lastname firstName           city     state
0     Wang     Allen            NaN       NaN
1    Alice       Bob  New York City  New York

In [157]:
outputdf.isnull()

   lastname  firstName   city  state
0     False      False   True   True
1     False      False  False  False

In [158]:
outputdf.fillna("this is empty",inplace = True)
outputdf

  lastname firstName           city          state
0     Wang     Allen  this is empty  this is empty
1    Alice       Bob  New York City       New York

In [159]:
outputdf.loc[1,'city']='Mumbai'
outputdf

  lastname firstName           city          state
0     Wang     Allen  this is empty  this is empty
1    Alice       Bob         Mumbai       New York

In [160]:
outputdf

  lastname firstName           city          state
0     Wang     Allen  this is empty  this is empty
1    Alice       Bob         Mumbai       New York

In [161]:
outputdf.iloc[0,3]='westbengal'
outputdf

  lastname firstName           city       state
0     Wang     Allen  this is empty  westbengal
1    Alice       Bob         Mumbai    New York

In [162]:
outputdf.loc[outputdf['city']=='this is empty','city']='kolkatta'
outputdf

  lastname firstName      city       state
0     Wang     Allen  kolkatta  westbengal
1    Alice       Bob    Mumbai    New York